tap "shivammathur/php"
tap "symfony-cli/tap"
tap "blackfireio/homebrew-blackfire"

cask_args appdir: "~/Applications"

# Web browsers
# cask "brave-browser" -- blocked.
cask "font-meslo-lg-nerd-font"
# cask "firefox" -- installed
cask "chromedriver"
cask "raycast"
# cask "google-chrome" -- already installed by Workspace One, skipping in pro env.
cask "jetbrains-toolbox"

# Code related tools
cask "bruno"
cask "mitmproxy"
cask "neovide"
cask "visual-studio-code"
cask "wezterm"

# General tools
cask "dozer"
cask "figma"
cask "imageoptim"
cask "handbrake"
cask "keepingyouawake"
cask "localsend"
cask "raindropio"
cask "rectangle"
cask "ticktick"
cask "vlc"

# And the brew formulaes
brew "act"
brew "bat"
brew "blackfire"
brew "blackfire-php82"
brew "blackfire-php83"
brew "cloc"
brew "cocoapods"
brew "colima"
brew "direnv"
brew "dnsmasq"
brew "dust"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fd"
brew "git"
brew "gh"
brew "gnu-sed"
brew "go"
brew "htop"
brew "httpie"
brew "jenv"
brew "jq"
brew "jesseduffield/lazygit/lazygit"
brew "minio"
brew "maven"
brew "mysql@5.7", restart_service: true, link: true, conflicts_with: ["mysql"]
brew "mysql-client@5.7", link: true
brew "mtr"
brew "nvim"
brew "openjdk@11"
brew "parallel"
brew "powerlevel10k"
brew "postgresql@16"
brew "pv"
brew "scw" # Scaleway cli
brew "terraform"
brew "tmux"
brew "tree"
brew "rabbitmq"
brew "redis"
brew "ripgrep"
brew "volta"
brew "watch"
brew "watchman"
brew "wget"
brew "zellij"
brew "zsh"

# PHP related stuff
brew "symfony-cli/tap/symfony-cli"
brew "shivammathur/php/php@8.3"
brew "shivammathur/php/php@8.2"

