tap "shivammathur/php"
tap "symfony-cli/tap"
tap "blackfireio/homebrew-blackfire"
tap "dunglas/frankenphp"

cask_args appdir: "~/Applications"

# Web browsers
cask "brave-browser"
cask "font-meslo-lg-nerd-font"
cask "firefox"
cask "chromedriver"
cask "raycast"
# cask "google-chrome" -- already installed by Workspace One, skipping in pro env.
cask "jetbrains-toolbox"

# Code related tools
cask "android-studio"
cask "bruno"
cask "deezer"
cask "gcloud-cli"
cask "mitmproxy"
cask "neovide-app"
cask "postgres-unofficial"
cask "visual-studio-code"
cask "wezterm"

# General tools
cask "calibre"
# cask "dozer"
cask "figma"
cask "imageoptim"
cask "handbrake-app"
cask "keepingyouawake"
cask "localsend"
cask "raindropio"
cask "ticktick"
cask "vlc"

# And the brew formulaes
brew "act"
brew "bat"
brew "blackfire"
brew "cloc"
brew "cocoapods"
brew "colima"
brew "direnv"
brew "dnsmasq"
brew "dust"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "gnu-sed"
brew "go"
brew "htop"
brew "hub"
brew "httpie"
brew "jenv"
brew "jq"
brew "lazygit"
brew "minio"
brew "maven"
brew "mysql@8.0"
brew "mysql-client@8.0"
brew "mtr"
brew "nvim"
brew "ncdu"
brew "openjdk@11"
brew "osmfilter"
brew "parallel"
brew "powerlevel10k"
brew "pv"
brew "scw" # Scaleway cli
brew "terraform"
brew "tmux"
brew "tree"
brew "rabbitmq"
brew "rabbitmq-c"
brew "redis"
brew "ripgrep"
brew "tippecanoe"
brew "qemu"
brew "volta"
brew "watch"
brew "watchman"
brew "wget"
brew "zoxide"
brew "zsh"

# PHP related stuff
brew "symfony-cli/tap/symfony-cli"
brew "shivammathur/php/php@8.3"
brew "shivammathur/php/php@8.4"

