tap "homebrew/cask"

# Web browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Code related tools
cask "iterm2"
cask "jetbrains-toolbox"
cask "dbeaver-community"
cask "postman"
cask "visual-studio-code"
cask "sequel-ace"

# General tools
cask "dozer"
cask "libreoffice"
cask "notion"
cask "keepassxc"
cask "keepingyouawake"
cask "licecap"
cask "slack"
cask "spotify"
cask "rectangle"
cask "ticktick"
cask "imageoptim"

# And the brew formulaes
brew "git"

# MySQL, correct this and update 
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysq
